import type { Point } from '../types';

export function gliderGun(): Point[] {
  const
    offsetX = 0/* Math.trunc(w / 2) + 18 */,
    offsetY = 0/*  Math.trunc(h / 2) + 5 */,
    dots: [number, number][] = [
      // Левый квадрат
      [1, 5], [2, 5], [1, 6], [2, 6],

      // Левая часть "пушки"
      [11, 5], [11, 6], [11, 7],
      [12, 4], [12, 8],
      [13, 3], [13, 9],
      [14, 3], [14, 9],
      [15, 6],
      [16, 4], [16, 8],
      [17, 5], [17, 6], [17, 7],
      [18, 6],

      // Правая часть "пушки"
      [21, 3], [21, 4], [21, 5],
      [22, 3], [22, 4], [22, 5],
      [23, 2], [23, 6],
      [25, 1], [25, 2], [25, 6], [25, 7],

      // Правый квадрат
      [35, 3], [36, 3], [35, 4], [36, 4]
    ];

  return dots.map(([x, y]) => ({
    x: x + offsetX,
    y: y + offsetY
  }));
};